app/controllers/buckets_controller.rb

SELECT "buckets".* FROM "buckets"
---
  def index
    @buckets = Bucket.all