app/controllers/proposals_controller.rb

SELECT "proposals".* FROM "proposals"
---
  def index
    @proposals = Proposal.all

INSERT INTO "proposals" ("item", "price", "monthly", "imageString", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
def url
         p params

    key = 'SEM3770FE56767FEDC920DD0DE5EA0480975'
    secret = 'Y2VkNzlkODQwYTI5NjAxMjAxOTEwYTdhMmQwN2I5ODQ'

    sem3 = Semantics3::Products.new(key,secret)

    sem3.products_field("url", params[:url])
    productsHash = sem3.get_products()
    bigJson = productsHash.to_json

    p bigJson
 p "-------------------------------------"
 bigJson = productsHash.to_json

     priceString = productsHash["results"][0]["price"]
     imageString = productsHash["results"][0]["images"][0]
     nameString = productsHash["results"][0]["name"]

     prop = Proposal.new
     prop.item = nameString
     prop.imageString = imageString
     prop.price = priceString.to_f
     prop.monthly = prop.price / 8
     prop.monthly = 8
     prop.user_id = 1


prop.save