app/controllers/proposals_controller.rb

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_proposal
      @proposal = Proposal.find(params[:id])