app/controllers/users_controller.rb

  def lol
      p params["bucket"]

      thebuck = params["bucket"]

      bucket = Bucket.new(item: thebuck["item"], price: Float(thebuck["price"]), monthly: Float(thebuck["monthly"]), months: Float(thebuck["months"]), user_id: "1", imageString: thebuck["imageString"])
      bucket.save
---
INSERT INTO "buckets" ("item", "monthly", "price", "months", "imageString", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"