app/controllers/users_controller.rb

  def create

    p params
    @user = User.new(first_name: params[:first_name])

    # respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["first_name", "emmet"], ["created_at", "2017-06-13 18:46:35.657422"], ["updated_at", "2017-06-13 18:46:35.657422"]]